x = float(input("Введіть координату Х: "))
y = float(input("Введіть координату Y: "))

if x==0 and y==0: 
    print("Точка знаходиться на початку координат") 
elif x==0:
	print("Точка знаходиться на осі Y")
elif y==0:
	print("Точка знаходиться на осі Х")
elif x>0 and y>0:
	print("Точка знаходиться в першому квадранті")
elif x>0 and y<0:
	print("Точка знаходиться в четвертому квадранті")
elif x<0 and y>0:
	print("Точка знаходиться в другому квадранті")
else:
	print("Точка знаходиться в третьому квадранті")
